# CLI tools
brew "git"
brew "bat"
brew "delta"
brew "diffnav"
brew "lazygit"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "direnv"
brew "zoxide"
brew "atuin"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-you-should-use"

# Fonts (system-wide via Homebrew Cask)
cask "font-jetbrains-mono"

# Optional: cmux terminal (macOS); uncomment if you use it
# tap "manaflow-ai/cmux"
# cask "cmux"
